In [42]:
import pandas as pd

cols = ['c1', 'c2', 'c3','c4']
lst = []
for a in range(2):
    lst.append([7, 8, 0 ,'A'])
df1 = pd.DataFrame(lst, columns=cols)
df1

   c1  c2  c3 c4
0   7   8   0  A
1   7   8   0  A

In [43]:
cols = ['c1', 'c2', 'c3','c4']
df2 = pd.DataFrame(columns=cols, index=range(2))
for a in range(2):
    df2.loc[a].c1 = 7
    df2.loc[a].c2 = 5
    df2.loc[a].c3 = 6
    df2.loc[a].c4 = 'a'
df2

  c1 c2 c3 c4
0  7  5  6  a
1  7  5  6  a

In [44]:
df = df.reset_index(drop=True)

In [45]:
df2

  c1 c2 c3 c4
0  7  5  6  a
1  7  5  6  a

In [46]:
df1

   c1  c2  c3 c4
0   7   8   0  A
1   7   8   0  A

In [67]:
newdf = pd.DataFrame()
newdf2 = pd.DataFrame()
for i in df2.index:
    if df2.loc[i, 'c1'] == df1.loc[i, 'c1']:
        print("ok")
        newdf['StatusServidor'] =  str(df2.loc[i, 'c1'])
    else:
        print("deu ruim")
        newdf['StatusServidor'] = newdf.str('NOT Ok')
    if df2.loc[i, 'c2'] == df1.loc[i, 'c2']:
        print("ok")
        newdf['StatusRotina'] = 'Ok'
    else:
        print("deu ruim")
        newdf['StatusRotina'] = 'NOT Ok'
    if df2.loc[i, 'c3'] == df1.loc[i, 'c3']:
        print("ok")
        newdf['StatusSigla'] = 'Ok'
    else:
        print("deu ruim")
        newdf['StatusSigla'] = 'NOT Ok'
    if df2.loc[i, 'c4'] == 'a':
        print("ok")
        newdf['StatusAmbiente'] = 'Ok'
    else:
        print("deu ruim")
        newdf['StatusAmbiente'] = 'NOT Ok'
    newdf2 = newdf2.append(newdf)
    print(i)
newdf2

ok
deu ruim
deu ruim
ok
0
ok
deu ruim
deu ruim
ok
1

Empty DataFrame
Columns: [StatusServidor, StatusRotina, StatusSigla, StatusAmbiente]
Index: []

In [57]:
newdf = pd.DataFrame()

In [61]:
newdf2['Total'] = 50

In [62]:
type(newdf2)

pandas.core.frame.DataFrame

In [63]:
newdf2

Empty DataFrame
Columns: [StatusServidor, StatusRotina, StatusSigla, StatusAmbiente, tes, Total]
Index: []

In [22]:
df2.shape

(2, 3)

In [23]:
df1.shape

(2, 3)

In [24]:
df2.index

RangeIndex(start=0, stop=2, step=1)

In [25]:
df1.index

RangeIndex(start=0, stop=2, step=1)

In [26]:
df2.columns

Index(['c1', 'c2', 'c3'], dtype='object')

In [27]:
df1.columns

Index(['c1', 'c2', 'c3'], dtype='object')

In [29]:
df2.count()

c1    2
c2    2
c3    2
dtype: int64

In [30]:
df1.count()

c1    2
c2    2
c3    2
dtype: int64

In [31]:
df2.sum()

c1    14.0
c2    10.0
c3    12.0
dtype: float64

In [32]:
df1.sum()

c1    14
c2    16
c3     0
dtype: int64

In [33]:
df2.describe()

        c1  c2  c3
count    2   2   2
unique   1   1   1
top      7   5   6
freq     2   2   2

In [34]:
df1.describe()

        c1   c2   c3
count  2.0  2.0  2.0
mean   7.0  8.0  0.0
std    0.0  0.0  0.0
min    7.0  8.0  0.0
25%    7.0  8.0  0.0
50%    7.0  8.0  0.0
75%    7.0  8.0  0.0
max    7.0  8.0  0.0

In [ ]:
d2f.loc[0, 'c2']